{
    "recipes" : [
        {
            "title" : "peach + raspberry tart",
            "svg" : "../../../public/tart.svg",
            "colour" : "#52b7880",
            "explain" : "easy tart that you can whip up hella quick and is pretty",
            "describe" : ["This is my favourite dessert from when I was a kid. Quick to make, and you can just use tinned peaches and frozen raspberries so its even easier."],
            "ingredients" : [["125 salted butter, softened"], ["1 cup sugar"], ["1t vanilla"], ["2 eggs"], ["1.5 cups SRF"], ["2 peaches cut as wedges"], ["150g raspberries"], ["2T icing sugar if you extra"]],
            "method" : [["Set oven to 160C and linke a 22cm round cake tin with baking paper"], ["Cream the butter, sugar and vanilla together. Have fun using a fork if you don't have a stand mixer..."], ["Add eggs and beat well"], ["Fold in the flour and spoon into cake tin"], ["Top it with the peaches and raspberries"], ["Bake till done (usually about an hour"], ["Sprinkle with icing sugar on top if you fancy"]]
        },
        {
            "title" : "mushroom + leek pie",
            "svg" : "../../../public/pie.svg",
            "colour" : "#ba181b",
            "explain" : "tasty pies that freeze well",
            "describe" : ["My new favourite meal prep... lots of mushroom, very tasty and can just pop in the oven from the freezer whenever I want one! Adimttedly does have more dairy in it than I'd like but hey"],
            "ingredients" : [["0.5kg ya fave mushrooms (doesn't have to be one type)"], ["1 large leek"], ["2T olive oil"], ["3 garlic cloves minced"], ["100g sour cream"], ["2t thyme dried or fresh"], ["s & p to taste"], ["1t lemon juice"], ["1t worcestershire (or really any flavouring you want, I did bbq sauce and soy sauce last time)"], ["bit of sriracha"], ["handful of grated parmesan"], ["3 sheets puff pastry"], ["150g  high moisture content cheese"]],
            "method" : [["Go bonkers dicing all the mushrooms and the leeks"], ["Sautee the leek and garlic over medium heat till soft"], ["Add all the mushies and sautee until cooked out properly"], ["Throw in sour cream, thyme and pepper and cook till it thickens, about three minutes"], ["Let the mixture cool in a bowl for a bit, before adding the lemon, sriracha, parmesan and worster. Adjust to taste."], ["From here, it's really just contstruction. I don't have a pie maker so I preheat oven to ~220C and then cut my puff pastry sheets in half so I can make little hand pies/pasties. Chuck some mixture off center of your pastry halves, and sprinkle some cheese on top, then them fold them over to make ya little pie pocket thingy"], ["Crimp the edges with a fork and poke some holes in the top. Adding a bit of egg wash before you chuck them in the oven will also help them look nice and shiny"]]

        },
        {
            "title" : "dahl",
            "svg" : "../../../public/dahl.svg",
            "colour" : "#f9c74f",
            "explain" : "lentil based curry type thing",
            "describe" : ["Great way to get some lentils into ya. My favourite curry type thing, it's pretty tasty, hard do wrong and meal preps well for the fridge."],
            "ingredients" : [["1 large onion"], ["3 cloves garlics"], ["1t ginger"], ["1 bay leaf"], ["1T olive oil"], ["1 cup red lentils"], ["2t curry powder"], ["1t turmeric"], ["3 cups vegetable stock"], ["1 cup chopped sweet potato"], ["1/2 red capsicum"], ["1/2 cup coconut milk"], ["2 cups baby spinach"]],
            "method" : [["Dice the onion, mince garlic and grate ginger. Let them all get to know each other in some oil with the bay leaf."], ["Once everything is soft and tasty looking, throw in the spices and lentils and fry them for around 2 minutes, going ham with the stirring the whole time."], ["Chuck in the stock, then the sweet potato, capsicum and coconut milk. Cook for around 20 minutes until lentils are cooked and it has thickened up. Make sure you stir every now and again so the lentils don't stick to the bottom. Can use more stock/water if need be."], ["Mix in the baby spinach at the end."]]
        },
        {
            "title" : "beans",
            "svg" : "../../../public/charro.svg",
            "colour" : "#f3722c",
            "explain" : "vegetarian mexican style beans",
            "describe" : ["Great mince replacement. Goes really well in rice and bean burritos or nachos etc. or just generally as a mince replacement. Use whatever beans and spices you like but I would say a good amount of cumin and paprika is a good starting point. Beanswise I like a combination of black beans, red kidney beans or pinto."],
            "ingredients" : [["2 cans of beans"], ["3 cans of crushed tomatoes"], ["2 large onions"], ["4 cloves of garlic"], ["1 cup of shredded veggies or shopped mushies"], ["coupla teaspoons of paprika"], ["coupla teaspoons of cumin"], ["lil bit o' fresh chilli"], ["teaspoon or two of tumeric or ground coriander"], ["2T neutral oil"], ["S&P to taste"]],
            "method" : [["Finely dice onion and mince garlic. Sautee onion and garlic until lookin tasty"], ["Add a bit of oil then add all the spices and chilli to let them open up in the oil for a minute or two"], ["Chuck in ya beans. I like to leave some of the bean water in as well as it is quite starchy and helps to make it all come together nice and thiccc."], ["Tomatoes go in as well. Let it simmer and reduce for half an hour or so. Add any extra spices and season to taste."]]
        },
        {
            "title" : "quinoa + veg",
            "svg" : "../../../public/quinoa.svg",
            "colour" : "#43aa8b",
            "explain" : "roast veg and quinoa salad",
            "describe" : ["Not a bad healthy jobbie. Great for when you've got a bunch of random veg to use."],
            "ingredients" : [["whatever roastable veggies you've got (potato, onion, carrot, garlic, zuchini...)"], ["drizzle of olive oil"], ["quinoa"], ["balsamic vinegar"], ["baby spinach"], ["S&P to taste"]],
            "method" : [["Chop up the veggies and throw 'em on a baking tray. Drizzle with a bit of olive oil and season (I also like to season with a chilli spice rub). Chuck in the oven on around 200 degrees C"], ["Cook some quinoa. Just follow instruction on back of packet but absorption method is the way to go"], ["Once veggies are done, throw in a bowl and mix with quinoa and baby spinach. Drizzle with balsamic vinegar and EAT!"]]
        },
        {
            "title" : "risotto",
            "svg" : "../../../public/risotto.svg",
            "colour" : "#118ab2",
            "explain" : "roast pumpkin risotto",
            "describe" : ["Honestly this one is just tasty."],
            "ingredients" : [["2 cups arborio rice"], ["idk how much vegetable stock"], ["half a butternut pumpkin"], ["cup of chopped mushies"], ["1 large onion"], ["3 cloves garlic"], ["3t dried sage (or fresh sage if you boujee)"], ["some cheese"], ["S&P to taste"], ["2T olive oil"], ["handful of baby spinach and rocket"]],
            "method" : [["Dice the pumpkin, and roast until just cooked. (Alternatively, if you cannae be assed roasting, grate the pumpkin and just chuck it in raw)"], ["Dice the onion and garlic, then sautee in the oil over medium-high heat."], ["Once the onions are soft add the mushrooms then sautee. Honestly the more caramelization on these early ingredients the better (will mean your risotto is a bit more brown but eh). If you grated your pumpkin, you can chuck it in here."], ["Add the arborio rice. Let it cook dry until the edges of the rice are transparent."], ["Now comes the fun part. Add cup by cup the vege stock. To get it real good you should add the stock incremently which means you kind of have to stand and stir. Continue adding stock until the rice is just past al dente (or however you like it)."], ["Chuck in the pumpkin and some cheese to melt through. Then season with salt and pepper."], ["Take off the heat and stir through the baby spinach. There should be enough residual heat to cook it through."]]
        },
        {
            "title" : "soup",
            "svg" : "../../../public/soup.svg",
            "colour" : "#ef476f",
            "explain" : "roast veg soup",
            "describe" : ["Great way to use up any veggies that need eating. Nice in winter."],
            "ingredients" : [["whatever roastable veggies you've got (potato, onion, carrot, garlic, zuchini...)"], ["vegetable stock"], ["salt and pepper"]],
            "method" : [["Chop up the veggies and throw 'em on a baking tray. Drizzle with a bit of olive oil and season. Chuck in the oven on around 200 degrees C"], ["Once the veggies are close to cooked through and are nice and caramelized, throw them in a pot and cover with vegetable stock."], ["Once you're satisfied it's all cooked through, whip out the stick blender and go bonkers on it. Season to taste and you're done."], ["Good vege combos : potato and leek (maybe sautee leek instead of roasting), capsicum, sweet potato and onion, pumpkin and corn..."]]
        },
        {
            "title" : "gyoza",
            "svg" : "../../../public/gyoza.svg",
            "colour" : "#bdb2ff",
            "explain" : "vege dumplings",
            "describe" : ["Good op if you be feeling a tad fancy"],
            "ingredients" : [["3T neutral oil for frying, 4T for mixture"], ["1T minced ginger"], ["1 large onion"], ["2 cups finely chopped mushies"], ["1.5 cups finely shredded cabbage"], ["1.5 cups finely shredded carrot"], ["1 cup finly chopped chives"], ["S&P to taste"], ["2t sesame oil"], ["3T Shaoxing wine (chinese cooking wine)"], ["2T soy sauce"], ["1t sugar (can leave out)"], ["dumpling wrappers"]],
            "method" : [["Chop up all your ingredients. Getting them nice and finely chopped will lead to a much more wrappable mixture."], ["Stir-fry the ginger over medium-high heat in the oil until fragrant (maybe 30 seconds), then add the onion to cook till translucent."], ["Add the mushies and stir-fry for a few minutes, until all the liquid has been released and cooked off from the mushrooms."], ["In gose the cabbage and carrot. Stir-fry for another 2 minutes or so, until liquid has again been released and cooked off. Once this is done take off heat and transfer to a mixing bowl to cool."], ["Add to the mixture all the other ingredients (minus the dumpling wrappers you numpty). Mix through until homogenous."], ["If you're white like me, go watch you're favourite how to wrap dumplings tutorial and go nuts."], ["Cook them however you like then eat! My favourite is pan fry them. Put just enough oil to cover the bottom of the pan and heat up. Pop in the dumplings and cook until there is a nice crisp on the bottom. I like to then flip them over before adding a bit of water (maybe half a cup) to let the steam and cook through. Wait till the water is evaporated and they crisp up again before taking them out."]]
        }
    ],
    "projects" : [
        {
            "title" : "this website",
            "svg" : "../../../public/artbro.svg",
            "colour" : "#bdb2ff",
            "date" : "September 2020",
            "summary" : ["The continual development of this website kind of tells the tale of my own evolution as a developer. I first made it in January 2020, using Django with pure HTML, CSS and some injected JS. Iteration two moved on to React, but still had quite an outdated, monochromatic feel to it. This website is iteration three! It was made using my React app boilerplate. I'm quite happy with how it turned out, it is a bit of a return to simplicity but I like it!"],
            "learning" : [["Making a more textured, elegant interface"], ["playing around with svg's, all custom made in Adobe Illustrator"], ["A bit of a consolidation of my growth and learning over the past year, to produce a very simple but sophisticated webpage!"]],
            "notes" : [["The two previous websites exist in an older repo, which you can see ", "<a=https://github.com/zachjbrowning/zjbsite>here", "."]]
        },
        {
            "title" : "openbook",
            "svg" : "../../../public/openbook.svg",
            "colour" : "#f898a4",
            "date" : "September 2020",
            "summary" : ["Hate extensive note taking 😤😤? Sick of online open book exams with way too much content (thanks coronavirus😠😠🦠🦠)?? The solution: Openbook 📖. Openbook is a simple webapp that organises and stores your notes for you, with the capacity to organise and search through your notes by note titles, keywords, or the content itself. Exam mode provides a simple, uncluttered interface to quickly find your relevant notes, rather than wasting precious time thumbing through reams of unorganised notes🥰🥰!!"],
            "learning" : [["A fully functional API utilising the REST framework"], ["Doing a proper full stack, with django as the backend and react as the frontend"], ["I tried to be a little bit more elegant with the styling, using react spring in some places to aid the animations."]],
            "notes" : [["This is actually a little tool I initially created to help me with an exam. I then decided it was a concept that might actually be useful, so I turned it into a website!"], ["I've taken the website down but you can still see the repository from my github."]]
        },
        {
            "title" : "reaction",
            "svg" : "../../../public/reaction.svg",
            "colour" : "#f94144",
            "date" : "July 2020",
            "summary" : ["A little web app I made using React Made this cause I was bored and wanted to play around with React a bit.. Next time I'm bored I'll add some more minigames to it!"],
            "learning" : [["React, react, react"], ["Backend frontend interactions"], ["JS async function overkill"]],
            "notes" : [["I like the minimal theme on this one"]]
        },
        {
            "title" : "zest",
            "svg" : "../../../public/zest.svg",
            "colour" : "#ffd166",
            "date" : "June 2020",
            "summary" : ["This is a framework I worked on developing during my term 1/2 break. My dad wanted me to build a website for him, but I didn't want to always have to check up and work on the site for him. I wanted something that was more friendly to him, but still allowed me to build the more complex aspects of the site. My solution was the Zest framework, which builds pages from JSON files that anyone could write. I've taken the site down but you can still see it from the github repository."],
            "learning" : [["Creating a frontend that makes calls to a backend to collect information"], ["Building a framework that fails gracefully, rather than crashing without showing cause for the error"], ["Getter deeper and deeper into the wonders of React.js!!"]],
            "notes" : [["This is by no means a finished product. I've run out of time to work on it for now but I hope to be able to come back and clean it up and make it into a more useable product."],["This project was inspired by building this website and using a json file to produce this exact page. Every time I add a project, I just edit the json file. The parser I built for that has found its way to here, letting me add html-ish stuff like ", "<a=https://zachjbrowning.tech/>links,", "<b> bold,", " and ", "<i> italics."]]
        },
        {
            "title" : "investbot",
            "svg" : "../../../public/investbot.svg",
            "colour" : "#43aa8b",
            "date" : "December 2019",
            "summary" : ["In 2019 I made a conscious decision to start investing ethically. So I did! My new investments were great, but with one small issue - I couldn't track and look at my historical data... what a great opportunity to try out some automation! My bot logs into my account every night and takes note of the current value of each of my investments. It then saves this data and generates a graph plotting my historical data that I can view."],
            "learning" : [["Data manipulation and handling"], ["Webscraping (selenium)"], ["Small task automation with bash scripts"]],
            "notes" : [["The data manipulation was done using Python"], ["Funnily enough the webscraping part wasn't the hardest part of this little project - it was the damned x-axis labels on the graph! A whole bunch of issues around the date strings retrieved from the website being in different formats, what happens when a new investment is added, do you have a label for each month, how do you stop them from overlapping... Essentially, a really small and unimportant problem that I spent way too long solving..."], ["Unfortunately I haven't made the git repo for this project public due to privacy concerns. I enjoyed trying to solve the problem of abstracting away things like login details so they can't be seen but nonetheless I decided not to share it because I don't want my financial situation public for all to see! If you're interested get in contact and I'd be more than happy to explain the bot more."]]
        }

    ]
}